app/controllers/coins_controller.rb

  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save
---
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @coin.update(coin_params)
---
UPDATE "coins" SET "url_image" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["url_image", "https://www.vhv.rs/dpng/d/420-4206472_fork-cryptocurrency-ethereum-bitcoin-classic-png-download-ethereum.png"], ["updated_at", "2020-06-10 18:53:46.849555"], ["id", 2]]

    def set_mining_type_options
      @mining_type_options = MiningType.all.pluck(:description, :id)
---
SELECT "mining_types"."description", "mining_types"."id" FROM "mining_types"