app/controllers/mining_types_controller.rb

  def index
    @mining_types = MiningType.all
---
SELECT "mining_types".* FROM "mining_types"

  def create
    @mining_type = MiningType.new(mining_type_params)

    respond_to do |format|
      if @mining_type.save
---
INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "test"], ["acronym", "tst"], ["created_at", "2020-06-12 15:13:16.037143"], ["updated_at", "2020-06-12 15:13:16.037143"]]

  def update
    respond_to do |format|
      if @mining_type.update(mining_type_params)
---
UPDATE "mining_types" SET "acronym" = ?, "updated_at" = ? WHERE "mining_types"."id" = ?  [["acronym", "PoCs"], ["updated_at", "2020-06-12 15:12:52.800726"], ["id", 3]]

  def destroy
    @mining_type.destroy
---
DELETE FROM "mining_types" WHERE "mining_types"."id" = ?  [["id", 4]]

    def set_mining_type
      @mining_type = MiningType.find(params[:id])
---
SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]